In [30]:
import pandas as pd
import numpy as np

In [14]:
df = pd.DataFrame({"keys": ["a", "b", "c"], "values":[1,2,3]})

In [15]:
df

  keys  values
0    a       1
1    b       2
2    c       3

In [16]:
df.set_index('keys',inplace=True)

In [12]:
df

      values
keys
a          1
b          2
c          3

SyntaxError: invalid syntax (<ipython-input-23-cb2d16280c48>, line 1)

In [38]:
ds = pd.Series(np.random.randn(3),name='values2')

In [39]:
ds.index =['a','b','c']

In [40]:
pd.concat([df,ds], axis=1)

   values   values2
a       1 -0.229077
b       2 -0.197056
c       3  1.232230

In [42]:
df.stack()

keys
a     values    1
b     values    2
c     values    3
dtype: int64

In [52]:
df = pd.DataFrame(np.arange(9).reshape(3,3), index=['a','c','d'],
                 columns=['BC','Alberta', 'Sask'])

In [53]:
df

   BC  Alberta  Sask
a   0        1     2
c   3        4     5
d   6        7     8

In [54]:
df.stack()

a  BC         0
   Alberta    1
   Sask       2
c  BC         3
   Alberta    4
   Sask       5
d  BC         6
   Alberta    7
   Sask       8
dtype: int64

In [55]:
df.stack().unstack()

   BC  Alberta  Sask
a   0        1     2
c   3        4     5
d   6        7     8

In [56]:
df.stack().unstack(level=0)

         a  c  d
BC       0  3  6
Alberta  1  4  7
Sask     2  5  8

In [58]:
df.mean(axis='rows')

BC         3.0
Alberta    4.0
Sask       5.0
dtype: float64

In [59]:
!pip install pandas_datareader

Collecting pandas_datareader
  Downloading pandas_datareader-0.9.0-py3-none-any.whl (107 kB)
     |████████████████████████████████| 107 kB 3.5 MB/s eta 0:00:01
Requirement already satisfied: lxml in /Users/mike/.virtualenvs/ds1-analytics/lib/python3.9/site-packages (from pandas_datareader) (4.6.3)
Requirement already satisfied: pandas>=0.23 in /Users/mike/.virtualenvs/ds1-analytics/lib/python3.9/site-packages (from pandas_datareader) (1.2.5)
Requirement already satisfied: requests>=2.19.0 in /Users/mike/.virtualenvs/ds1-analytics/lib/python3.9/site-packages (from pandas_datareader) (2.25.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/mike/.virtualenvs/ds1-analytics/lib/python3.9/site-packages (from pandas>=0.23->pandas_datareader) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /Users/mike/.virtualenvs/ds1-analytics/lib/python3.9/site-packages (from pandas>=0.23->pandas_datareader) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in /Users/mike/.virtualenvs/ds1-analytics/lib/python3.9/site-packages (from pandas>=0.23->pandas_datareader) (1.21.0)
Requirement already satisfied: six>=1.5 in /Users/mike/.virtualenvs/ds1-analytics/lib/python3.9/site-packages (from python-dateutil>=2.7.3->pandas>=0.23->pandas_datareader) (1.16.0)
Requirement already satisfied: certifi>=2017.4.17 in /Users/mike/.virtualenvs/ds1-analytics/lib/python3.9/site-packages (from requests>=2.19.0->pandas_datareader) (2021.5.30)
Requirement already satisfied: chardet<5,>=3.0.2 in /Users/mike/.virtualenvs/ds1-analytics/lib/python3.9/site-packages (from requests>=2.19.0->pandas_datareader) (4.0.0)
Requirement already satisfied: idna<3,>=2.5 in /Users/mike/.virtualenvs/ds1-analytics/lib/python3.9/site-packages (from requests>=2.19.0->pandas_datareader) (2.10)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in /Users/mike/.virtualenvs/ds1-analytics/lib/python3.9/site-packages (from requests>=2.19.0->pandas_datareader) (1.26.6)
Installing collected packages: pandas-datareader
Successfully installed pandas-datareader-0.9.0

In [61]:
df.stack().unstack(level=1)

   BC  Alberta  Sask
a   0        1     2
c   3        4     5
d   6        7     8

In [72]:
data = pd.Series(np.random.randn(9))
data

0    1.077280
1   -0.814484
2    0.334999
3    1.211168
4   -1.081359
5    1.011158
6    1.141533
7   -0.290021
8   -0.037980
dtype: float64

In [73]:
data.index = [['a','a','a', 'b', 'b', 'c','c','d','d'], [1,2,3,1,3,1,2,2,3]]
data

a  1    1.077280
   2   -0.814484
   3    0.334999
b  1    1.211168
   3   -1.081359
c  1    1.011158
   2    1.141533
d  2   -0.290021
   3   -0.037980
dtype: float64

In [74]:
data = data.unstack()

In [87]:
frame = pd.DataFrame(np.arange(12).reshape(4,3),
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['BC','BC','Ala'],['Orange','Blue','Brown']])
frame

        BC        Ala
    Orange Blue Brown
a 1      0    1     2
  2      3    4     5
b 1      6    7     8
  2      9   10    11

In [88]:
frame.index.names = ['key1','key2']
frame

              BC        Ala
          Orange Blue Brown
key1 key2
a    1         0    1     2
     2         3    4     5
b    1         6    7     8
     2         9   10    11

In [81]:
data.columns.names=['categories','values']

In [82]:
data

categories    rating
values             M         F   overall
a           1.077280 -0.814484  0.334999
b           1.211168       NaN -1.081359
c           1.011158  1.141533       NaN
d                NaN -0.290021 -0.037980

In [83]:
data.stack()

categories              rating
  values
a F              NaN -0.814484
  M              NaN  1.077280
  overall   0.334999       NaN
b M              NaN  1.211168
  overall  -1.081359       NaN
c F              NaN  1.141533
  M              NaN  1.011158
d F              NaN -0.290021
  overall  -0.037980       NaN